[UNK]
[SPACE]
!
"
#
%
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
H
I
K
M
N
O
P
Q
S
T
U
X
Y
Z
[
\
^
_
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
|
~
¥
´
·
ε
π
ω
ฅ
ั
็
๑
༵
ᐛ
᷄
᷅
—
’
“
”
•
…
‸
‾
‿
⃣
←
→
↖
↗
∠
≦
≧
⊙
⋯
╭
╮
╯
╰
□
▽
◕
★
♥
♪
⚘
✪
❀
❤
➕
、
。
《
「
」
【
】
づ
ㅎ
㳂
一
丁
七
万
三
上
下
不
与
专
且
世
业
东
丝
丢
两
严
丧
个
丫
中
丰
串
临
丸
丹
为
主
丽
举
久
么
义
之
乌
乎
乐
乖
乘
九
也
习
乡
书
买
乱
乳
了
予
事
二
于
亏
云
互
五
亚
些
亟
交
产
亩
享
京
亮
亲
人
亿
什
仁
仅
今
介
仍
从
仑
仓
仔
他
付
仙
代
令
以
仨
们
仰
件
价
任
份
仿
伎
休
众
优
伙
会
伟
传
伤
伦
估
伴
伺
似
但
位
低
住
佐
体
何
余
佛
作
你
佣
佩
佬
佳
使
來
例
供
依
侥
侧
侮
侯
便
促
俗
保
俞
信
俩
修
俱
俺
倆
個
倍
們
倒
候
借
倡
倦
值
假
偏
做
停
健
偶
偷
偿
傅
備
催
傻
像
僵
儿
元
兄
充
先
光
克
免
兑
兔
兜
入
全
兩
八
公
六
兮
兰
共
关
兴
其
具
典
养
兽
内
再
冒
写
军
农
冬
冰
冲
决
况
冷
冻
净
凄
准
凉
凌
减
凑
凝
几
凤
凭
凯
凶
凸
出
击
刀
分
切
划
列
则
刚
创
初
删
別
利
别
刮
到
制
刷
券
刺
刻
剁
剂
削
剌
前
剔
剥
剧
剩
剪
副
力
劝
办
功
加
务
劣
动
助
努
劲
劳
劵
势
勁
勉
勒
務
勺
勾
勿
匀
包
匍
匐
化
北
匙
匹
区
医
十
千
升
午
半
华
协
卑
单
卖
南
博
卜
占
卡
卤
卧
卫
印
危
即
却
卵
卷
卸
厅
历
厉
压
厌
厕
厘
厚
原
厥
厦
厨
去
参
又
叉
及
友
双
反
发
叔
取
受
变
口
古
句
另
只
叫
叮
可
台
史
右
叶
号
司
叹
叼
叽
吁
吃
各
合
吉
吊
同
名
后
吐
向
吓
吕
吖
吗
吞
否
吧
含
听
吭
吮
启
吵
吸
吹
吻
吼
吾
呀
呃
呆
告
呐
呕
呗
员
呛
呜
呢
呦
周
呲
味
呵
呸
呼
命
咋
和
咒
咕
咖
咧
咨
咬
咯
咱
咳
咸
咽
咾
品
哇
哈
响
哎
哑
哒
哗
哟
哥
哦
哧
哪
哭
哼
唇
唉
唐
唔
唤
唧
唬
售
唯
商
啊
啡
啤
啥
啦
啧
喂
善
喇
喉
喊
喔
喘
喜
喝
單
喱
喷
喽
嗎
嗒
嗓
嗖
嗦
嗮
嗯
嗽
嘉
嘎
嘛
嘞
嘟
嘭
嘱
嘴
嘻
嘿
噎
噢
器
噩
噱
嚷
嚼
囊
囗
四
回
因
团
囧
园
困
围
固
国
图
圆
圈
土
圣
在
地
场
圾
址
均
坊
坏
坐
坑
块
坚
坛
坡
坦
坨
垃
型
垫
埃
埋
城
域
培
基
堂
堆
堡
堪
堵
塌
塑
塘
塞
填
境
增
墟
墨
壁
壞
壤
士
壮
声
壳
处
备
复
夏
外
多
夜
够
大
天
太
夫
失
头
夸
夹
夾
奇
奈
奉
奏
奔
奖
套
奢
奥
奧
女
奶
奸
她
好
如
妃
妄
妇
妈
妙
妥
妹
妻
始
姐
姑
委
姗
姜
姥
姨
姿
威
娃
娘
娜
婆
婚
婴
媒
嫁
嫌
嫩
子
孕
字
存
孙
孜
季
学
孩
宁
它
宅
宇
守
安
完
宏
宗
官
宙
定
宜
宝
实
宠
审
客
室
宫
宮
害
宴
宵
家
容
宽
宾
宿
寄
密
富
寒
寡
實
寨
寸
对
导
寿
封
将
將
尊
小
少
尔
尖
尘
尚
尝
尤
尬
就
尴
尸
尺
尼
尽
尾
屁
层
居
屈
屋
屌
屎
屏
屑
展
属
屮
屯
山
岁
岂
岔
岛
岩
岸
峰
崔
崩
崴
巍
川
州
巢
工
左
巧
巨
差
己
已
巴
巾
市
布
帅
师
希
帐
帕
帖
帝
带
師
帮
常
帽
幅
幌
干
平
年
并
幸
幻
幼
广
庄
庆
床
序
应
底
店
庙
府
废
度
座
康
廉
延
建
开
异
弃
弄
弊
式
引
弟
张
弹
强
归
当
录
形
彩
彬
彭
影
彻
彼
往
征
径
待
很
後
徒
得
微
德
心
必
忆
忌
忍
忒
志
忘
忙
忠
忧
快
念
忽
怀
态
怎
怏
怒
怕
怖
怜
思
急
性
怨
怪
总
恋
恍
恐
恒
恨
恩
恭
息
恰
恳
恶
恼
悄
悉
悔
悠
您
悬
悲
情
惊
惋
惚
惜
惠
惧
惨
惩
惫
惯
想
惹
愉
意
感
愣
愤
愧
愿
態
慎
慢
慰
憾
懂
懈
懒
懵
戈
戏
成
我
或
战
戚
戟
截
戳
户
房
所
扁
手
才
扎
扒
打
扔
托
扣
扫
扬
扮
扯
扰
批
找
承
技
抄
把
抑
抓
投
抖
抗
折
抠
抢
护
报
披
抬
抱
抵
抹
押
抽
担
拆
拉
拌
拍
拎
拒
拔
拖
招
拜
拥
拨
择
括
拭
拯
拳
拼
拾
拿
持
挂
指
按
挑
挖
挚
挞
挡
挣
挤
挥
挨
挺
挻
挽
捂
捉
捎
捞
损
捡
换
捧
据
捷
掂
掉
掌
掏
掐
排
掣
接
控
推
掩
措
掺
描
提
插
握
揽
搁
搓
搜
搞
搪
搬
搭
摄
摆
摇
摊
摔
摩
摸
撂
撑
撒
撕
撤
擂
擅
操
擦
攥
支
收
改
放
故
效
敌
敏
救
教
敢
散
敬
数
敲
整
敷
文
斑
斗
料
斤
断
斯
新
斷
方
施
旁
族
旗
无
既
日
旦
旧
旨
早
时
旺
昌
明
昏
易
星
映
春
昨
昭
是
显
時
晃
晓
晕
晖
晚
晦
晨
普
智
晾
暂
暑
暖
暗
暴
曝
曰
曲
更
替
最
會
月
有
朋
服
朗
望
朝
期
木
未
末
本
术
朴
朵
机
杀
杂
权
杆
杏
材
村
杞
束
条
来
杨
杭
杯
杰
東
杳
松
板
极
构
枉
林
枚
果
枞
枣
枪
架
枸
某
染
柔
柚
柠
查
柳
柴
査
柿
标
栏
树
栗
校
样
核
根
格
桂
案
桌
桐
桔
档
桥
桶
梁
梅
梗
條
梦
梧
梨
梯
检
棍
棒
森
椅
植
椒
椰
楂
楚
楞
楼
概
榄
榛
榜
榨
榴
槽
樂
模
樣
横
橙
檬
欠
次
欢
欣
欲
欺
款
歉
止
正
此
步
武
歪
歸
歹
歺
死
殊
残
殴
段
毁
母
每
毒
比
毕
毛
毫
民
氓
气
水
永
汁
求
汇
汉
汗
江
污
汤
汪
汽
沉
沌
沒
沙
沟
没
沪
沫
沱
河
油
治
沾
泉
法
泡
波
泥
注
泪
泰
泻
泼
洁
洋
洒
洗
洞
津
洱
洲
活
派
流
浅
浆
浇
测
济
浓
浙
浪
浮
海
浸
涂
消
涨
涩
涮
液
涼
淀
淇
淋
淌
淘
淡
淫
深
混
淹
添
清
渍
渝
渠
渡
渣
温
港
游
湄
湖
湘
湯
湿
溃
源
準
溜
溢
溫
溶
滋
滑
滓
滚
满
滥
滴
漂
漉
漏
漫
潇
潜
潮
激
灌
火
灰
灵
灼
炉
炎
炒
炖
炝
炫
炸
点
為
炼
烂
烈
烘
烙
烛
烟
烤
烦
烧
烩
烫
热
烹
焉
焖
焗
焙
焦
焯
然
煎
煞
煤
照
煮
煲
煸
熊
熏
熔
熘
熟
熬
熱
燕
爆
爛
爪
爬
爱
父
爷
爸
爹
爽
片
版
牌
牙
牛
牢
物
牲
特
犯
状
犹
狂
狗
狠
狡
独
狮
猛
猜
猪
猫
猴
率
玉
王
玛
玩
玫
环
现
玲
珍
珑
珠
班
球
理
瑕
瑰
瓜
瓣
瓶
瓷
甘
甚
甜
生
用
田
由
甲
申
电
男
画
畅
界
留
略
番
疏
疑
疙
疚
疯
疲
疼
疾
病
痛
痴
痹
瘤
瘦
瘩
瘪
瘾
癌
登
白
百
的
皇
皮
皱
盆
益
盏
盐
监
盒
盖
盗
盘
盛
盟
目
直
相
盾
省
眉
看
真
眼
着
睁
睛
睡
督
睬
睹
瞄
瞎
瞬
瞻
矛
知
矩
短
石
矿
码
砂
研
砖
砣
破
砸
硌
硬
确
碌
碍
碎
碑
碗
碜
碟
碧
碰
碱
碳
磅
磕
磨
示
礼
社
祝
神
票
祸
禀
禁
福
离
私
秃
秋
种
科
秒
秘
秩
积
称
稀
程
稍
稚
稠
種
稳
稻
究
穷
空
穿
突
窝
立
竖
站
竟
童
端
竹
竽
笋
笑
笔
符
笨
第
笼
等
筋
筑
筒
答
筷
签
简
箔
算
管
箭
箱
簸
籍
米
类
籽
粉
粑
粒
粗
粘
粤
粥
粮
粽
精
糊
糕
糖
糙
糟
糠
糯
系
級
素
索
紧
紫
累
給
絮
經
網
繁
纠
红
纤
约
级
纪
纯
纳
纸
线
组
细
织
终
绍
经
绒
结
绕
给
络
绝
统
继
续
维
绵
综
绿
缓
编
缘
缝
缠
缩
缸
缺
罐
网
罚
罢
罩
罪
置
羊
美
群
羹
翅
翔
翻
老
考
者
而
耍
耐
耗
耦
耳
耶
耻
耽
聊
职
联
聚
聩
聪
肃
肉
肋
肌
肘
肚
肝
肠
股
肥
肪
肯
育
肴
肺
胀
胁
胃
胆
胎
胖
胗
胚
胜
胡
胶
胸
能
脂
脆
脊
脏
脐
脑
脖
脚
脱
脸
脾
腊
腌
腐
腔
腥
腩
腰
腹
腻
腾
腿
膀
膜
膨
膻
自
臭
至
致
舌
舍
舒
舔
航
般
良
色
艳
艸
艹
艺
艾
节
芋
芒
芔
芝
芡
芥
芦
芬
花
芹
芽
苍
苏
苔
苗
若
苦
苹
茂
范
茄
茬
茴
茶
茻
草
荐
荒
荞
荣
荤
药
荷
莓
莫
莲
莴
菇
菊
菌
菜
菠
萄
萌
萝
营
萦
萧
萨
落
著
葡
葩
葫
葱
葵
蒜
蒸
蓉
蓝
蓬
蔑
蔫
蔬
蔽
蕃
蕉
蕨
蕾
薄
薅
薏
薦
薪
薯
薹
藏
藕
藻
蘑
蘸
虎
虑
虚
虫
虹
虽
虾
蚁
蚂
蚊
蛋
蛏
蛙
蛤
蛮
蛰
蛳
蛹
蜀
蜂
蜓
蜗
蜜
蜡
蜻
蝇
蝉
蝴
蝶
螂
融
螺
蟑
蟹
蠢
血
行
衍
街
衣
补
表
衰
袋
袖
被
裂
装
裏
裕
裙
裝
裡
裤
裸
裹
褶
襄
西
要
见
观
规
视
览
觉
角
解
言
訂
註
誉
誓
說
調
請
警
議
计
订
认
讨
让
训
议
讯
记
讲
许
论
设
证
评
诅
识
诈
诉
诊
词
试
诚
话
询
该
详
诫
语
误
说
诶
请
诺
课
诿
谁
调
谅
谈
谎
谓
谢
谨
谱
谷
豆
豇
豉
象
豪
豫
貌
負
責
費
貼
賣
質
贝
负
贡
财
责
败
账
货
质
贩
贪
购
贯
贴
贵
费
贼
贿
资
赌
赐
赔
赖
赚
赛
赞
赠
赢
赤
走
赵
赶
起
趁
超
越
趋
趟
趣
足
趴
跌
跑
距
跟
跩
跪
路
跳
踏
踢
踩
踪
踹
蹄
蹭
蹲
躁
身
躬
躲
躺
軟
车
转
轮
软
轰
轻
载
较
辄
辅
辆
辈
输
辗
辘
辙
辛
辜
辞
辣
辩
辰
辱
边
达
迅
过
迈
迎
运
近
返
还
这
进
远
连
迟
迫
述
迷
迹
追
退
送
适
逃
选
透
递
途
逗
這
通
速
造
逢
逼
逾
遂
遇
遍
過
道
遗
遲
避
還
那
邦
郁
郊
部
郭
都
鄙
配
酒
酥
酪
酱
酷
酸
酿
醉
醋
醒
醬
采
释
里
重
野
量
金
鉴
錯
针
钉
钟
钢
钥
钮
钱
钵
钻
铁
铂
铃
铝
铧
铭
银
铺
销
锁
锅
锈
锋
错
锡
锦
键
锻
镜
长
门
闭
问
闲
间
闷
闹
闺
闻
阁
队
防
阳
阴
阵
阻
阿
陀
附
际
陆
陈
陋
降
限
院
除
险
陪
陷
隆
随
隐
隔
障
难
集
雇
雞
難
雨
雪
零
雷
雾
需
霆
震
霉
霍
露
霸
霾
青
静
非
靠
面
革
鞋
鞠
鞭
韧
韩
韭
音
页
顶
项
顺
须
顾
顿
预
领
颇
颖
颗
题
颜
额
颠
颤
风
飘
飙
飞
食
飯
飲
餅
餐
餸
饥
饨
饪
饭
饮
饱
饶
饺
饼
饿
馄
馅
馆
馈
馊
馋
馍
馒
首
香
馨
騙
马
驰
驴
驻
驼
骂
验
骑
骗
骚
骨
髒
高
鬼
魂
魏
魔
魚
鱼
鱿
鲁
鲅
鲍
鲜
鲤
鲫
鲮
鲶
鳃
鳕
鳗
鸟
鸡
鸭
鸽
鸿
鹌
鹑
麦
麵
麸
麻
麼
麽
黄
黏
黑
默
點
鼻
齁
齐
龄
龊
龌
龙
龜
龟
꒫


️
︶
︿
﹉
﹏
！
＂
（
）
，
．
／
：
；
？
＿
｀
～
｡
￣
